<?php

/*
 *  User: dirty
 *  Email: shijie1991@gmail.com
 */

namespace Database\Seeders;

use Illuminate\Database\Seeder;

class FeedContentTableSeeder extends Seeder
{
    /**
     * Auto generated seed file.
     */
    public function run()
    {
        \DB::table('feed_content')->delete();

        \DB::table('feed_content')->insert([
            0 => [
                'feed_id' => 1,
                'text' => '海上月是天上月，眼前人是心上人。可是，眼前人已非彼时人，两两相望唯余失望.',
                'created_at' => '2020-08-05 14:24:53',
                'updated_at' => '2020-08-05 14:24:53',
            ],
            1 => [
                'feed_id' => 2,
                'text' => '-   那些不敢相信爱情的男孩子们听大弟一句话：短短一生我们终将失去，你不妨大胆一点，爱一个人是做一个梦，即使我爱你是心里话，等你爱是大冒险.',
                'created_at' => '2020-08-05 14:25:14',
                'updated_at' => '2020-08-05 14:25:14',
            ],
            2 => [
                'feed_id' => 3,
                'text' => '带🧠来',
                'created_at' => '2020-08-05 14:25:34',
                'updated_at' => '2020-08-05 14:25:34',
            ],
            3 => [
                'feed_id' => 4,
                'text' => '一千多的灯泡留给爷男人，就等这个男人出现了',
                'created_at' => '2020-08-05 14:25:40',
                'updated_at' => '2020-08-05 14:25:40',
            ],
            4 => [
                'feed_id' => 5,
                'text' => '互心',
                'created_at' => '2020-08-05 14:25:45',
                'updated_at' => '2020-08-05 14:25:45',
            ],
            5 => [
                'feed_id' => 6,
                'text' => '午好！',
                'created_at' => '2020-08-05 14:25:49',
                'updated_at' => '2020-08-05 14:25:49',
            ],
            6 => [
                'feed_id' => 7,
                'text' => '不要光点赞啦
跟我换情头呀
哼






',
                'created_at' => '2020-08-05 14:25:55',
                'updated_at' => '2020-08-05 14:25:55',
            ],
            7 => [
                'feed_id' => 8,
                'text' => '零碎的岛屿会找到海.',
                'created_at' => '2020-08-05 14:26:00',
                'updated_at' => '2020-08-05 14:26:00',
            ],
            8 => [
                'feed_id' => 9,
                'text' => '喜欢独处，却又害怕孤独。',
                'created_at' => '2020-08-05 14:26:04',
                'updated_at' => '2020-08-05 14:26:04',
            ],
            9 => [
                'feed_id' => 10,
                'text' => '有空一起谈个恋爱，没空我继续暗恋你',
                'created_at' => '2020-08-05 14:26:09',
                'updated_at' => '2020-08-05 14:26:09',
            ],
            10 => [
                'feed_id' => 11,
                'text' => '有次晚上十点自己放学走回家，路口碰到小混混街头打架砸啤酒瓶那种，我就站那愣了一会，有个混混看我也愣了一下，然后扭头砸了一个啤酒瓶说"别动，让人家小姑娘过去"',
                'created_at' => '2020-08-05 14:26:13',
                'updated_at' => '2020-08-05 14:26:13',
            ],
            11 => [
                'feed_id' => 12,
                'text' => '希望所有的烦恼都离屏幕前的这个小笨蛋远一点 |ω･)و ̑̑༉',
                'created_at' => '2020-08-05 14:26:18',
                'updated_at' => '2020-08-05 14:26:18',
            ],
            12 => [
                'feed_id' => 13,
                'text' => '崩溃了😭😭😭',
                'created_at' => '2020-08-05 14:26:22',
                'updated_at' => '2020-08-05 14:26:22',
            ],
            13 => [
                'feed_id' => 14,
                'text' => '同事为什么总能把最难吃和最难喝的东西订回来！










',
                'created_at' => '2020-08-05 14:26:28',
                'updated_at' => '2020-08-05 14:26:28',
            ],
            14 => [
                'feed_id' => 15,
                'text' => '你是落日弥漫的橘，是天边透亮的星。',
                'created_at' => '2020-08-05 14:26:33',
                'updated_at' => '2020-08-05 14:26:33',
            ],
            15 => [
                'feed_id' => 16,
                'text' => '哥哥多大和哥哥多大是两回事',
                'created_at' => '2020-08-05 14:26:38',
                'updated_at' => '2020-08-05 14:26:38',
            ],
            16 => [
                'feed_id' => 17,
                'text' => '认真找个女朋友😉
93年 东北人 巨蟹座
目前在北京工作（最好也是在北京的）
喜欢小猫 喜欢火锅
最近很少玩游戏了（偶尔吃鸡 电脑单机）
喜欢看动漫 科幻 悬疑 丧尸类的电影 （看不了恐怖的😂）
听说釜山行2要上映了(●°u°●)​ 」
喜欢开朗 比较粘人的女朋友
希望不管快乐难过都可以一起分享
我就是一个普普通通的男孩
圈子很小 你来了就是唯一
可爱的你 要了解一下嘛😆






',
                'created_at' => '2020-08-05 14:26:42',
                'updated_at' => '2020-08-05 14:26:42',
            ],
            17 => [
                'feed_id' => 18,
                'text' => '来玩吧',
                'created_at' => '2020-08-05 14:26:48',
                'updated_at' => '2020-08-05 14:26:48',
            ],
            19 => [
                'feed_id' => 20,
                'text' => '随口说了一句我想喝奶茶就有奶茶 谢谢我哥 啵啵~',
                'created_at' => '2020-08-05 14:27:02',
                'updated_at' => '2020-08-05 14:27:02',
            ],
            20 => [
                'feed_id' => 21,
                'text' => '午好朋友们',
                'created_at' => '2020-08-05 14:27:08',
                'updated_at' => '2020-08-05 14:27:08',
            ],
            21 => [
                'feed_id' => 22,
                'text' => '互心不单取',
                'created_at' => '2020-08-05 14:27:12',
                'updated_at' => '2020-08-05 14:27:12',
            ],
            22 => [
                'feed_id' => 23,
                'text' => '男朋友 你在嘛',
                'created_at' => '2020-08-05 14:27:17',
                'updated_at' => '2020-08-05 14:27:17',
            ],
            24 => [
                'feed_id' => 25,
                'text' => '窝是乖乖美女',
                'created_at' => '2020-08-05 14:27:30',
                'updated_at' => '2020-08-05 14:27:30',
            ],
            25 => [
                'feed_id' => 26,
                'text' => '哦～天呐…老夫的少女心，突然觉得自己也是个小朋友了呢[笑哭][笑哭][笑哭]',
                'created_at' => '2020-08-05 14:27:38',
                'updated_at' => '2020-08-05 14:27:38',
            ],
            26 => [
                'feed_id' => 27,
                'text' => '嘿！那兄弟你要不要做我男人
他们说喜欢一个人就要直接',
                'created_at' => '2020-08-05 14:27:44',
                'updated_at' => '2020-08-05 14:27:44',
            ],
        ]);
    }
}
