<?php

/*
 *  User: dirty
 *  Email: shijie1991@gmail.com
 */

namespace Database\Seeders;

use HighKer\Core\Models\SensitiveWords;
use Illuminate\Database\Seeder;

class KeywordShieldTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run()
    {
        $str = '乱伦 乳头 乳房 乳晕 乳沟 卖比 卖逼 双乳 双峰 双沟 发春 发浪 发骚 受孕 叫床 吮吸 呻吟 咪咪 四级片 处女膜 夜激情 射精 小鸡鸡 屁眼 巨乳 巨波 失身 奸尸 奸淫 妈逼 妓女 娇喘 婊子 媚妙 开苞 强奸 强暴 性交 性奴 性欲 性爱 性虐待 情欲 情色 sB sb SB Sb 嫩b 嫩B 大花逼 大逼 手淫 消魂 淫乱 淫妇 淫娃 淫欲 淫穴 淫荡 淫贱 淫靡 荡妇 肛交 肛门 私处 精液 烂比 烂逼 肉棒 肉缝 肏 肛 胴体 臀沟 自慰 自摸 自焚 色图 色情 色欲 色诱 花蕊 芳穴 狂操 狗操 猥亵 玉体 生殖器 大鸡巴 大雞巴 约炮 操比 操逼 一夜情 风骚 骚妇 骚妖 骚妹 骚货 骚蹄子 色电影 色妹妹 色视频 色小说 裸体 阳具 阴唇 阴水 阴茎 阴蒂 阴道 东京热 東京熱 胡紧套 胡錦濤 胡适眼 胡耀邦 湖淫娘 毛泽东 民主 民运 江太上 江系人 江贼民 疆獨 习近平 邓小平 江泽民 锦涛 华国锋 温家堡 温切斯特 温影帝 溫家寶 瘟加饱 瘟假饱 赵紫阳 胡锦涛 希脏 习进平 彭丽媛 习太上 胡太上 毛太上 鄧小平 专政 中共 台湾独立 台独 官商勾 官也不容 官因发帖 多党 党官 党后萎 天安门屠杀 被中共 共狗 东北独立 十大禁 自由圣 自由亚 独立台湾 共王储 拉登 六四 共产党 党中央 天鹅之旅 圣战 阿扁推翻 王立军 一党 基地组织 ISIS 蒋介石 孙中山 孙民主义 陸肆 6月4日 学潮 藏独 薄熙来 洞小口紧 乱奸 乱伦类 乱伦小 亂倫 伦理大 伦理电影 伦理毛 伦理片 蜜穴 插屁屁 狗交 狗性 狗做 姐包夜 姐服务 姐兼职 姐上门 新金瓶 金瓶 激情妹 激情炮 鸡奸 鸡巴 柔胸粉 肉洞 肉棍 滚圆大乳 女被人家搞 女激情 女技师 女人和狗 女秘书 女上门 女優 摩小姐 母乳家 情聊天室 情妹妹 情视频 情自拍 挤乳汁 擠乳汁 性爱 性福情 性感 性推广 逼样 酥胸 妹按摩 妹上门 门按摩 门保健 門服務 攻官小姐 要射精了 要射了 要泄了 液体炸 乳交 兼职上门 裸聊网 裸舞视 浪穴 冰火九重 骚妇 骚浪 骚穴 骚嘴 诱奸 豪乳 换妻 娘两腿之间 妞上门 浓精 丝足按 恋足 恋尸 秽物 奶子 深喉 吹萧 聊视频 手木仓 手槍 总会美女 援交 轮奸 小穴 鲍鱼 夫妻交换 藏春阁 凤楼 颜射 陰唇 陰道 陰戶 淫魔舞 淫情女 淫肉 淫騷妹 淫兽 淫兽学 淫水 淫穴 破处 绳虐 招妓 美乳 群P 群奸 爆奶 高潮 幼齿类 玉蒲团 鸳鸯洗 3级片 4级片 AV A片 A级 JJ 推油 打飞机 春水 學生妹 兽交 嫩穴 嫩阴 精子射在 吃精 吞精 内射 就爱插 爱液 发伦 发伦功 发抡 发抡功 发论 发论公 发论功 抡功 氵去 氵去车仑工力 转法轮 轮大 法*功 法lun功 法仑 法伦 法功 法十轮十功 法愣 法论 法谪 法轮 法轮功 法轮大法 法车仑 法伦功 法轮 法轮佛 法维权 法一轮 真善忍 炼大法 李洪志 轮功 伦功 大法 李宏志 李鸿志 李红志 操他 操你 操你妈 操蛋 日你 日你妈 日死你 去你妈的 傻逼 艹 草泥马 操了嫂 操嫂子 你妈的 干你娘 干死你 我操你 靠你妈 杂种 操场 打钱 日赚 博彩 卡上 卡号 充值 充钱 办本科 办理 文凭 办怔 办证 廿一点 廿五点 彩票 彩钻 微信 催眠水 催情粉 催情药 催情藥 挫仑 毕业证 答案包 答案提供 发票出 发票代 发票销 發票 蒙汗药 迷幻型 迷幻药 迷幻藥 迷昏口 迷昏药 迷昏藥 迷魂香 迷魂药 迷魂藥 迷奸药 迷情水 迷情药 迷藥 開碼 開票 虐待 虐猫 虐畜 冰毒 吗啡 虐狗 摇头丸 K粉 鸦片 海洛因 杜冷丁 可卡因 古柯 咖啡因 疆独 西藏天葬 艾玛拉嘉络 李洪志 监听王 昏药 麻醉钢枪 胡海峰 江泽民 胡锦涛 温家宝 六四学潮 麻醉枪 迷奸药 催情药 六四事件 大法轮 麻古 台独 毛泽东 K粉 六四 法轮功 李宏志 李义强 法论功 六四 达赖 天安门事件 六四之役 中共邪教 大法洪传 弘法体 法轮佛法 宇宙最高法理 五套功法 大法之声 江独裁 圆明网 发正念 大法大福 大硞弟子 支联会 流氓民运 法輪功 六决不 江泽民其人 奸淫 出售猎枪 自焚 九评共产党 代开租赁发票 明慧周刊 支持台湾 报禁 党禁 鸽派 鹰派 赣江学院暴动 全国退党 维权抗暴 洪发交流 海外护法 亲共来源 黄色小说 台湾18DY电影 H动漫 亚热 包娃衣 法正人间 法正乾坤 嫩穴 六合采 股市民谣 淫间道 代开国税发票 火药制作 江氏 萬人暴 官逼民反 学生暴动 镇压学生 鸡巴 反中游行 痛批政法委 苏东解体 反右题材 卫星接收器 丁度巴拉斯 叶剑英 温家堡 蒋彦永 灭绝罪 华国锋 买春堂 信号拦截器 代开普通发票 代开商品发票 中国威胁论 性奴 劉奇葆 法lun功 杨尚昆 動乱 邪恶的党 出售迷药 湘阴县杨林 马加爵 习仲勋 刘伯承 许世友 纪登奎 苏振华 李德生 全新假钞 仿真假钞 制作炸弹 出售假钞 代开维修发票 代开建筑发票 代开安装发票 代开餐饮发票 代开服务发票 法轮 智能Ｈ３ 鸡吧 邓小平 香港总彩 六和采 香港赛马会 共铲党 共残党 共惨党 共chan党 点对点裸聊 蜜穴 代办员 转法轮 本拉登 西藏独立 新疆独立 朱镕基 周永康 胡系 八九动乱 江派 溜麻古 胡温 胡瘟 瘟家 温夫人 温公子 胡公子 温宝宝 温云松 江家帮 太子党 江系 江胡 民主党 胡紧套 胡紧掏 瘟家鸨 瘟假鸨 温假饱 毛贼东 毛厕洞 毛厕东 台湾独立 马英九 温加饱 卖假钞 泛绿 公投 蓝营 绿营 丁子霖 泛蓝 人权圣火 上书 致胡温 中国革命党 天网电子报 恐怖主义 恐怖袭击 自杀式爆炸 码中特 6合彩 六星合彩 六合菜 台湾间谍 统独光谱 台独党纲 台独党 迷魂蚊香 迷魂香烟 A型肉毒素 出售气枪 反右运动 文革 货到付款 售麻醉 军用手枪 邪党 天灭中 天要灭中 圣战 十字军 学潮 工字气枪 三箭气枪 秃鹰气枪 高压气枪 气枪子弹 购买气枪 仿真气枪 运动气枪 气枪专卖 气枪铅弹 气枪价格 气枪弹簧 温爷爷 江澤民 打砸抢 锦涛 胡J涛 胡春华 胡进涛 红卫兵 红志 宏志 宏治 洪志 李宏治 伯希来 薄熙来 党内权力 李红智 江驴 江绵恒 江牌 江泉集团 江梳头 江系人马 江宰民 江择min 圣火之战 赖昌星 彭丽媛 李洪智 李洪痣 李鸿智 林彪 大法 修煉 射精 真n善n忍 真善忍? 邪教 学生运动 退党声明 脱党 脱团 亡党 亡共者胡 九 评公产党 四人帮 文革释放 六四资料馆 氯硝安定 昆仑女神功 反共传单 反共言论 反人类罪 循环轮回论 燕玲论坛 一党独裁 一党专政 反革命政变纲领 6.4事件 64学潮 安立敏 八九学潮 炮兵参谋手册 胡的接班人 回民暴动 回民猪 回忆六四 鸡毛信文汇 积克馆 基督灵恩布道团 疾病业债说 江派和胡派 江派人马 江泽公审 江泽民宋祖英 江贼 解体中共 军队走私 抗议中共当局 达赖喇嘛 自焚';
        $array = explode(' ', $str);
        $count = count($array);
        $this->command->getOutput()->progressStart($count);
        foreach ($array as $keyword) {
            SensitiveWords::query()->create(['name' => $keyword, 'status' => 1]);
            $this->command->getOutput()->progressAdvance();
        }
        $this->command->getOutput()->progressFinish();
        $this->command->getOutput()->writeln('生成了' . $count . '个违禁词');
    }
}
